docs/reading-openclaw.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-01 Wed 13:41 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OpenClaw 代码乱读笔记1</title>
<meta name="author" content="Zi Liang" />
<meta name="description" content="搞懂这玩意儿到底是怎么跑起来的" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">OpenClaw 代码乱读笔记1</h1>
<blockquote>
<p>
警告：这不是官方文档，是我的个人笔记，可能理解有误！
</p>
</blockquote>
<div id="outline-container-orga659186" class="outline-2">
<h2 id="orga659186"><span class="section-number-2">1.</span> 前言：我为什么要读这个代码？</h2>
<div class="outline-text-2" id="text-1">
<p>
前几天刷 GitHub 看到 OpenClaw 这个项目 —— "多渠道 AI 网关"，听起来挺厉害的，能连 WhatsApp、Telegram、Slack 啥的。但是翻了一遍 README，感觉还是云里雾里的。
</p>

<p>
作为一个喜欢刨根问底的人，我决定：干脆直接读源码吧！
</p>

<p>
这篇就是我读代码时随手记的笔记，想到哪写到哪，可能有点乱，但都是真实的阅读过程。如果你也想读这个代码，也许我的笔记能给你点参考。
</p>
</div>
<div id="outline-container-org3968727" class="outline-3">
<h3 id="org3968727"><span class="section-number-3">1.1.</span> 免责声明</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>我不是 OpenClaw 的开发者</li>
<li>我的理解可能有错，欢迎指出</li>
<li>这不是教程，只是个人学习笔记</li>
<li>我会尽量贴代码，但不一定都对</li>
</ul>
</div>
</div>
<div id="outline-container-orga4ad017" class="outline-3">
<h3 id="orga4ad017"><span class="section-number-3">1.2.</span> 我的装备</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>项目：openclaw (commit 887ca6086)</li>
<li>Node.js：22+</li>
<li>编辑器：VS Code（随便用的）</li>
<li>心情：好奇 + 有点头疼</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcd78324" class="outline-2">
<h2 id="orgcd78324"><span class="section-number-2">2.</span> 第一章：哇，文件夹好多 —— 先随便看看结构</h2>
<div class="outline-text-2" id="text-2">
<p>
刚 <code>git clone</code> 完，打开目录一看，好家伙，这么多文件夹！让我先随便逛逛，看看都是些啥。
</p>
</div>
<div id="outline-container-orgd505848" class="outline-3">
<h3 id="orgd505848"><span class="section-number-3">2.1.</span> 1.1 根目录都有啥？</h3>
<div class="outline-text-3" id="text-2-1">
<p>
先 <code>ls -la</code> 一下（我只列重要的）：
</p>

<pre class="example" id="org8f5ca0c">
openclaw/
├── src/              ← 这个看起来是主要代码
├── apps/             ← 看来还有手机/电脑客户端
├── packages/         ← monorepo 的包？
├── skills/           ← 50 多个文件夹，啥技能？
├── extensions/       ← 38 个文件夹，扩展？
├── ui/               ← Web 界面？
├── docs/             ← 文档
├── test/             ← 测试
├── scripts/          ← 构建脚本
├── patches/          ← 给依赖打的补丁
├── vendor/           ← 第三方代码
├── Swabble/          ← 这是另一个项目？
└── ...（一堆配置文件）
</pre>

<p>
行吧，先记住：=src/= 应该是重点，我们后面主要看这个。
</p>
</div>
</div>
<div id="outline-container-org3ec72e0" class="outline-3">
<h3 id="org3ec72e0"><span class="section-number-3">2.2.</span> 1.2 先看看 package.json —— 这项目是干嘛的？</h3>
<div class="outline-text-3" id="text-2-2">
<p>
文件路径：=package.json=
</p>

<p>
每次看新项目我都先翻这个，能知道不少信息。让我读一下：
</p>

<div class="org-src-container">
<pre class="src src-json">{
  "name": "openclaw",
  "version": "2026.2.15",
  "description": "Multi-channel AI gateway with extensible messaging integrations",
  "type": "module",
  "bin": {
    "openclaw": "openclaw.mjs"
  },
  "main": "dist/index.js",
  "exports": {
    ".": "./dist/index.js",
    "./plugin-sdk": {
      "types": "./dist/plugin-sdk/index.d.ts",
      "default": "./dist/plugin-sdk/index.js"
    },
    ...
  },
  ...
}
</pre>
</div>

<p>
哦，原来是 ESM 模块（="type": "module"=），入口是 =openclaw.mjs=。描述说是"多渠道 AI 网关"。
</p>

<p>
看看依赖，能猜出不少东西：
</p>

<div class="org-src-container">
<pre class="src src-json">"dependencies": {
  "@mariozechner/pi-agent-core": "0.52.12",
  "@mariozechner/pi-ai": "0.52.12",
  "@mariozechner/pi-coding-agent": "0.52.12",
  "@mariozechner/pi-tui": "0.52.12",
  "grammy": "^1.40.0",
  "@slack/bolt": "^4.6.0",
  "@whiskeysockets/baileys": "7.0.0-rc.9",
  "ws": "^8.19.0",
  "express": "^5.2.1",
  "zod": "^4.3.6",
  ...
}
</pre>
</div>

<p>
看到这些依赖，我大概明白了：
</p>
<ul class="org-ul">
<li><code>@mariozechner/pi-*</code> —— 这几个包出现频率很高，应该是核心 AI 运行时</li>
<li><code>grammy</code> —— Telegram Bot 库</li>
<li><code>@slack/bolt</code> —— Slack Bot</li>
<li><code>@whiskeysockets/baileys</code> —— 这是 WhatsApp Web 的库</li>
<li><code>ws</code> —— WebSocket</li>
<li><code>express</code> —— HTTP 服务器</li>
<li><code>zod</code> —— 数据验证（这个库不错）</li>
</ul>

<p>
还有一堆别的，就不一一列了。
</p>
</div>
</div>
<div id="outline-container-orgb3f020a" class="outline-3">
<h3 id="orgb3f020a"><span class="section-number-3">2.3.</span> 1.3 重头戏：src/ 目录里面有啥？</h3>
<div class="outline-text-3" id="text-2-3">
<p>
文件路径：=src/=
</p>

<p>
让我们 <code>ls src/</code> 看看（我挑重要的列）：
</p>

<pre class="example" id="org9f40186">
src/
├── agents/            ← AI 代理相关？
├── auto-reply/        ← 自动回复？
├── browser/           ← 浏览器控制？
├── canvas-host/       ← Canvas 画布服务？
├── channels/          ← 渠道管理？
├── cli/               ← 命令行界面
├── commands/          ← CLI 命令实现
├── config/            ← 配置管理
├── cron/              ← 定时任务
├── daemon/            ← 守护进程
├── discord/           ← Discord 渠道
├── gateway/           ← 网关！这个目录很大，应该是核心
├── hooks/             ← Webhook？
├── imessage/          ← iMessage 渠道
├── infra/             ← 基础设施
├── line/              ← Line 渠道
├── logging/           ← 日志
├── media/             ← 媒体处理
├── memory/            ← 记忆管理
├── node-host/         ← 节点宿主？
├── plugins/           ← 插件系统
├── polls/             ← 投票？
├── process/           ← 进程管理
├── providers/         ← AI 提供商
├── security/          ← 安全相关（这个要重点看）
├── signal/            ← Signal 渠道
├── slack/             ← Slack 渠道
├── telegram/          ← Telegram 渠道
├── tts/               ← 语音合成
├── tui/               ← 终端 UI
├── ui/                ← UI 相关
├── utils/             ← 工具函数
├── web/               ← Web 相关（WhatsApp Web？）
├── wizard/            ← 向导？
└── ...（还有一些）
</pre>

<p>
有点意思，这个结构很清晰：
</p>
<ul class="org-ul">
<li>每个消息渠道都有单独的目录（=discord/=、=slack/=、=telegram/=、=web/= 等）</li>
<li><code>gateway/</code> 目录名字就很核心，而且文件很多</li>
<li><code>agents/</code> 应该是 AI 代理部分</li>
<li><code>security/</code> 是安全相关的（这个后面要仔细读）</li>
</ul>

<p>
这章先不深看，就是先混个脸熟。
</p>
</div>
</div>
<div id="outline-container-orgbe230ff" class="outline-3">
<h3 id="orgbe230ff"><span class="section-number-3">2.4.</span> 1.4 这章看完的感觉</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>OpenClaw 是个 Node.js 项目，用 TypeScript，而且是 ESM</li>
<li>核心代码肯定在 <code>src/</code> 里</li>
<li><code>src/gateway/</code> 看起来是核心中的核心</li>
<li>支持的渠道真多：WhatsApp、Telegram、Slack、Discord、Signal、iMessage、Line&#x2026;</li>
<li>还有 <code>security/</code> 目录，说明开发者还是考虑了安全的</li>
</ul>

<p>
好，第一章就到这，我们下一章看 Gateway 是怎么启动的。
</p>
</div>
</div>
</div>
<div id="outline-container-org6ec88b6" class="outline-2">
<h2 id="org6ec88b6"><span class="section-number-2">3.</span> 第二章：Gateway 是怎么启动的？—— 我来追踪一下 <code>openclaw gateway</code></h2>
<div class="outline-text-2" id="text-3">
<p>
行了，大概知道文件夹结构了。现在我们来搞明白：当你敲入 <code>openclaw gateway</code> 时，到底发生了什么？
</p>
</div>
<div id="outline-container-orgc7e0baf" class="outline-3">
<h3 id="orgc7e0baf"><span class="section-number-3">3.1.</span> 2.1 先看看入口：openclaw.mjs</h3>
<div class="outline-text-3" id="text-3-1">
<p>
文件路径：=openclaw.mjs=
</p>

<p>
这是 CLI 的入口文件，让我们看看：
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #96a0aa;">#!/usr/bin/env node
</span>
<span style="color: #ff79c6; font-weight: bold;">import</span> module from <span style="color: #f1fa8c; font-style: italic;">"node:module"</span>;

<span style="color: #96a0aa;">// </span><span style="color: #96a0aa;">&#21551;&#29992;&#32534;&#35793;&#32531;&#23384;
</span><span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #61bfff;">(</span>module.enableCompileCache &amp;&amp; !process.env.NODE_DISABLE_COMPILE_CACHE<span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">try</span> <span style="color: #ff79c6;">{</span>
    module.enableCompileCache<span style="color: #50fa7b;">()</span>;
  <span style="color: #ff79c6;">}</span> <span style="color: #ff79c6; font-weight: bold;">catch</span> <span style="color: #ff79c6;">{</span>
    <span style="color: #96a0aa;">// </span><span style="color: #96a0aa;">Ignore errors
</span>  <span style="color: #ff79c6;">}</span>
<span style="color: #61bfff;">}</span>

<span style="color: #96a0aa;">// </span><span style="color: #96a0aa;">... &#19968;&#20123;&#35686;&#21578;&#36807;&#28388;&#30340;&#20195;&#30721; ...
</span>
<span style="color: #96a0aa;">// </span><span style="color: #96a0aa;">&#23581;&#35797;&#23548;&#20837;&#32534;&#35793;&#21518;&#30340;&#20837;&#21475;&#25991;&#20214;
</span><span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #61bfff;">(</span><span style="color: #ff79c6; font-weight: bold;">await</span> tryImport<span style="color: #ff79c6;">(</span><span style="color: #f1fa8c; font-style: italic;">"./dist/entry.js"</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
  <span style="color: #96a0aa;">// </span><span style="color: #96a0aa;">OK
</span><span style="color: #61bfff;">}</span> <span style="color: #ff79c6; font-weight: bold;">else</span> <span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #61bfff;">(</span><span style="color: #ff79c6; font-weight: bold;">await</span> tryImport<span style="color: #ff79c6;">(</span><span style="color: #f1fa8c; font-style: italic;">"./dist/entry.mjs"</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
  <span style="color: #96a0aa;">// </span><span style="color: #96a0aa;">OK
</span><span style="color: #61bfff;">}</span> <span style="color: #ff79c6; font-weight: bold;">else</span> <span style="color: #61bfff;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">throw</span> <span style="color: #ff79c6; font-weight: bold;">new</span> <span style="color: #bd93f9;">Error</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c; font-style: italic;">"openclaw: missing dist/entry.(m)js (build output)."</span><span style="color: #ff79c6;">)</span>;
<span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
哦，挺简单的，就是加载编译后的 <code>dist/entry.js</code> 或 =dist/entry.mjs=。这是生产环境的入口。开发环境应该是直接用 tsx 跑 TypeScript 的。
</p>
</div>
</div>
