orgs/reading-openclaw.org
** 2.2 CLI 命令是怎么注册的？

我翻了一下 =src/cli/= 目录，发现命令是用 =commander= 库定义的。

文件路径：=src/cli/program/build-program.ts=

#+BEGIN_SRC typescript
export function buildProgram() {
  const program = new Command();
  const ctx = createProgramContext();
  const argv = process.argv;

  setProgramContext(program, ctx);
  configureProgramHelp(program, ctx);
  registerPreActionHooks(program, ctx.programVersion);

  registerProgramCommands(program, ctx, argv);  // ← 这里注册所有命令

  return program;
}
#+END_SRC

好，接下来看看 =gateway= 命令具体在哪。我找到了：

文件路径：=src/cli/gateway-cli/register.ts=

这里面注册了 =gateway= 命令，它最终会调用 =runGateway()= 函数。

** 2.3 找到了！启动函数在这：src/gateway/server.impl.ts

文件路径：=src/gateway/server.impl.ts=

终于找到核心了！=startGatewayServer()= 这个函数就是 Gateway 的启动入口。

先看一眼函数签名：

#+BEGIN_SRC typescript
export async function startGatewayServer(
  port = 18789,
  opts: GatewayServerOptions = {},
): Promise<GatewayServer> {
  // 哇，这个函数有 44KB 那么长！
  // 让我慢慢读...
}
#+END_SRC

44KB 的一个函数！这是要干嘛？我一开始以为看错了，后来确认了一下，真的是一个函数写了 44KB。这设计... 有点意思，一个函数干所有事情。

让我们试着拆解一下它的步骤（我按代码顺序整理的）：

*** 2.3.1 第一步：先把配置读了，还要迁移旧配置

函数一开始先做这些：

#+BEGIN_SRC typescript
// 先把环境变量里的端口设上，让其他地方也能读到
process.env.OPENCLAW_GATEWAY_PORT = String(port);

// 读取配置文件快照
let configSnapshot = await readConfigFileSnapshot();

// 检查有没有 legacy 的老配置，有的话要迁移
if (configSnapshot.legacyIssues.length > 0) {
  // ... 迁移逻辑 ...
  const { config: migrated, changes } = migrateLegacyConfig(configSnapshot.parsed);
  await writeConfigFile(migrated);
}
#+END_SRC

好，先把配置搞定，还要兼容旧版本的配置。

*** 2.3.2 第二步：初始化运行时状态

然后创建运行时状态：

#+BEGIN_SRC typescript
const runtimeState = createGatewayRuntimeState({
  initialPort: port,
  configSnapshot,
  // ... 其他参数
});
#+END_SRC

这个 =runtimeState= 是个什么东西？后面我再看，反正就是存各种运行时状态的。

*** 2.3.3 第三步：启动 HTTP 和 WebSocket 服务器

接下来是启动服务器：

#+BEGIN_SRC typescript
// 加载 TLS 配置（如果需要 HTTPS）
const tlsRuntime = await loadGatewayTlsRuntime({
  config: cfg,
  log: logTls,
});

// 创建 HTTP 服务器
// ...
// 处理 WebSocket 升级
// ...
#+END_SRC

这部分我们下一章再详细讲。

*** 2.3.4 第四步：加载插件

然后加载插件：

#+BEGIN_SRC typescript
const pluginRegistry = await loadGatewayPlugins({
  cfg,
  runtimeState,
  deps,
  log: logPlugins,
});
#+END_SRC

插件系统，后面有机会再看。

*** 2.3.5 第五步：启动各个渠道

然后启动渠道管理器：

#+BEGIN_SRC typescript
const channelManager = createChannelManager({
  cfg,
  runtimeState,
  pluginRegistry,
  deps,
  log: logChannels,
});
#+END_SRC

渠道就是 WhatsApp、Telegram 这些，这部分也很重要，后面单独一章讲。

*** 2.3.6 第六步：启动各种杂七杂八的服务

然后启动一堆服务：

#+BEGIN_SRC typescript
// 定时任务
const cronService = buildGatewayCronService({ ... });

// 服务发现
await startGatewayDiscovery({ ... });

// 维护任务
startGatewayMaintenanceTimers({ ... });

// 边车服务
await startGatewaySidecars({ ... });

// 健康检查
refreshGatewayHealthSnapshot({ ... });

// 还有更多...
#+END_SRC

*** 2.3.7 第七步：健康检查和日志

最后记录启动日志：

#+BEGIN_SRC typescript
logGatewayStartup({
  cfg,
  port: boundPort,
  host: finalHost,
  tlsRuntime,
  hasActiveChannels: channelManager.hasActiveChannels(),
  log,
});
#+END_SRC

好家伙，这一个函数真是把所有事情都干了！

** 2.4 启动时都能配什么？GatewayServerOptions

让我们看看启动时可以传什么参数：

#+BEGIN_SRC typescript
export type GatewayServerOptions = {
  bind?: GatewayBindMode;        // loopback/lan/tailnet/auto
  host?: string;                  // 可以强行指定绑定地址
  controlUiEnabled?: boolean;     // 要不要开控制 UI
  openAiChatCompletionsEnabled?: boolean;
  openResponsesEnabled?: boolean;
  auth?: GatewayAuthConfig;
  tailscale?: GatewayTailscaleConfig;
  // ... 还有一些测试用的选项
};
#+END_SRC

注意了！这里有个很重要的点：默认绑定是 =loopback=，也就是 127.0.0.1 —— 这意味着默认只有这台机器自己能访问 Gateway，其他机器连不上。这个后面讲安全的时候还要说。

** 2.5 这章看完的感觉

- Gateway 启动入口是 =startGatewayServer()=，在 =src/gateway/server.impl.ts=
- 默认端口是 18789
- 默认只监听 127.0.0.1（也就是只有这台机器自己能访问）
- 启动流程大概是：读配置 → 初始化状态 → 启服务器 → 加载插件 → 启动渠道 → 启动各种服务
- 这个函数真的太长了（44KB），什么都干

好，第二章就到这。下一章我们详细看 HTTP 和 WebSocket 服务器是怎么实现的。

* 第三章：Gateway 服务器里面都有啥？—— HTTP、WebSocket 和认证

上一章我们看到 Gateway 启动了 HTTP 和 WebSocket 服务器，这一章我们详细挖挖它们是怎么实现的。

** 3.1 HTTP 服务器：src/gateway/server-http.ts

文件路径：=src/gateway/server-http.ts=

这个文件定义了 HTTP 服务器的行为。我翻了一下，它处理的路由还挺多的，让我整理一下：

| 路径 | 功能 | 说明 |
|------|------|------|
| =/= | 重定向 | 重定向到 =/ui= 或其他 |
| =/ui/*= | 控制 UI | Web 管理界面 |
| =/ws= | WebSocket | WebSocket 升级端点 |
| =/v1/chat/completions= | OpenAI API | OpenAI 兼容 API |
| =/v1/responses= | OpenResponses API | 另一个 API |
| =/hooks/*= | Webhooks | 入站 Webhook |
| =/tools/*= | 工具调用 | 工具调用 HTTP API |
| =/canvas/*= | Canvas | Canvas 相关 |
| =/browser/*= | 浏览器 | 浏览器控制 |

一个 HTTP 请求进来时，大概是这么个流程：
1. 先做认证检查（=authorizeGatewayConnect()=）
2. 然后路由匹配
3. 最后执行对应的处理器

** 3.2 认证系统：src/gateway/auth.ts

文件路径：=src/gateway/auth.ts=

这个文件很重要！我仔细读了一下，这是 Gateway 的保安 —— 决定谁能进来，谁不能进来。

*** 3.2.1 都支持哪几种认证方式？

先看类型定义：

#+BEGIN_SRC typescript
export type ResolvedGatewayAuthMode = "none" | "token" | "password" | "trusted-proxy";
#+END_SRC

四种模式：
- =none= —— 无认证（不推荐！这相当于大门敞开）
- =token= —— Token 认证（用一个 secret token）
- =password= —— 密码认证
- =trusted-proxy= —— 受信任的代理（比如 Tailscale）

还有认证结果的类型：

#+BEGIN_SRC typescript
export type GatewayAuthResult = {
  ok: boolean;
  method?: "none" | "token" | "password" | "tailscale" | "device-token" | "trusted-proxy";
  user?: string;
  reason?: string;
  rateLimited?: boolean;      // 是否被限流了
  retryAfterMs?: number;      // 限流的话要等多久
};
#+END_SRC

