docs/reading-openclaw.html
<div id="outline-container-orga0cc44a" class="outline-3">
<h3 id="orga0cc44a"><span class="section-number-3">3.2.</span> 2.2 CLI 命令是怎么注册的？</h3>
<div class="outline-text-3" id="text-3-2">
<p>
我翻了一下 <code>src/cli/</code> 目录，发现命令是用 <code>commander</code> 库定义的。
</p>

<p>
文件路径：=src/cli/program/build-program.ts=
</p>

<div class="org-src-container">
<pre class="src src-typescript">export function buildProgram() {
  const program = new Command();
  const ctx = createProgramContext();
  const argv = process.argv;

  setProgramContext(program, ctx);
  configureProgramHelp(program, ctx);
  registerPreActionHooks(program, ctx.programVersion);

  registerProgramCommands(program, ctx, argv);  // ← 这里注册所有命令

  return program;
}
</pre>
</div>

<p>
好，接下来看看 <code>gateway</code> 命令具体在哪。我找到了：
</p>

<p>
文件路径：=src/cli/gateway-cli/register.ts=
</p>

<p>
这里面注册了 <code>gateway</code> 命令，它最终会调用 <code>runGateway()</code> 函数。
</p>
</div>
</div>
<div id="outline-container-orgc47813e" class="outline-3">
<h3 id="orgc47813e"><span class="section-number-3">3.3.</span> 2.3 找到了！启动函数在这：src/gateway/server.impl.ts</h3>
<div class="outline-text-3" id="text-3-3">
<p>
文件路径：=src/gateway/server.impl.ts=
</p>

<p>
终于找到核心了！=startGatewayServer()= 这个函数就是 Gateway 的启动入口。
</p>

<p>
先看一眼函数签名：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export async function startGatewayServer(
  port = 18789,
  opts: GatewayServerOptions = {},
): Promise&lt;GatewayServer&gt; {
  // 哇，这个函数有 44KB 那么长！
  // 让我慢慢读...
}
</pre>
</div>

<p>
44KB 的一个函数！这是要干嘛？我一开始以为看错了，后来确认了一下，真的是一个函数写了 44KB。这设计&#x2026; 有点意思，一个函数干所有事情。
</p>

<p>
让我们试着拆解一下它的步骤（我按代码顺序整理的）：
</p>
</div>
<div id="outline-container-orgbbd4898" class="outline-4">
<h4 id="orgbbd4898"><span class="section-number-4">3.3.1.</span> 2.3.1 第一步：先把配置读了，还要迁移旧配置</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
函数一开始先做这些：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// 先把环境变量里的端口设上，让其他地方也能读到
process.env.OPENCLAW_GATEWAY_PORT = String(port);

// 读取配置文件快照
let configSnapshot = await readConfigFileSnapshot();

// 检查有没有 legacy 的老配置，有的话要迁移
if (configSnapshot.legacyIssues.length &gt; 0) {
  // ... 迁移逻辑 ...
  const { config: migrated, changes } = migrateLegacyConfig(configSnapshot.parsed);
  await writeConfigFile(migrated);
}
</pre>
</div>

<p>
好，先把配置搞定，还要兼容旧版本的配置。
</p>
</div>
</div>
<div id="outline-container-org8e5ae02" class="outline-4">
<h4 id="org8e5ae02"><span class="section-number-4">3.3.2.</span> 2.3.2 第二步：初始化运行时状态</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
然后创建运行时状态：
</p>

<div class="org-src-container">
<pre class="src src-typescript">const runtimeState = createGatewayRuntimeState({
  initialPort: port,
  configSnapshot,
  // ... 其他参数
});
</pre>
</div>

<p>
这个 <code>runtimeState</code> 是个什么东西？后面我再看，反正就是存各种运行时状态的。
</p>
</div>
</div>
<div id="outline-container-org2a5c0f8" class="outline-4">
<h4 id="org2a5c0f8"><span class="section-number-4">3.3.3.</span> 2.3.3 第三步：启动 HTTP 和 WebSocket 服务器</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
接下来是启动服务器：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// 加载 TLS 配置（如果需要 HTTPS）
const tlsRuntime = await loadGatewayTlsRuntime({
  config: cfg,
  log: logTls,
});

// 创建 HTTP 服务器
// ...
// 处理 WebSocket 升级
// ...
</pre>
</div>

<p>
这部分我们下一章再详细讲。
</p>
</div>
</div>
<div id="outline-container-orgae2efd3" class="outline-4">
<h4 id="orgae2efd3"><span class="section-number-4">3.3.4.</span> 2.3.4 第四步：加载插件</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
然后加载插件：
</p>

<div class="org-src-container">
<pre class="src src-typescript">const pluginRegistry = await loadGatewayPlugins({
  cfg,
  runtimeState,
  deps,
  log: logPlugins,
});
</pre>
</div>

<p>
插件系统，后面有机会再看。
</p>
</div>
</div>
<div id="outline-container-orgeca6da9" class="outline-4">
<h4 id="orgeca6da9"><span class="section-number-4">3.3.5.</span> 2.3.5 第五步：启动各个渠道</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
然后启动渠道管理器：
</p>

<div class="org-src-container">
<pre class="src src-typescript">const channelManager = createChannelManager({
  cfg,
  runtimeState,
  pluginRegistry,
  deps,
  log: logChannels,
});
</pre>
</div>

<p>
渠道就是 WhatsApp、Telegram 这些，这部分也很重要，后面单独一章讲。
</p>
</div>
</div>
<div id="outline-container-org81c8ee8" class="outline-4">
<h4 id="org81c8ee8"><span class="section-number-4">3.3.6.</span> 2.3.6 第六步：启动各种杂七杂八的服务</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
然后启动一堆服务：
</p>

<div class="org-src-container">
<pre class="src src-typescript">// 定时任务
const cronService = buildGatewayCronService({ ... });

// 服务发现
await startGatewayDiscovery({ ... });

// 维护任务
startGatewayMaintenanceTimers({ ... });

// 边车服务
await startGatewaySidecars({ ... });

// 健康检查
refreshGatewayHealthSnapshot({ ... });

// 还有更多...
</pre>
</div>
</div>
</div>
<div id="outline-container-org23c9b22" class="outline-4">
<h4 id="org23c9b22"><span class="section-number-4">3.3.7.</span> 2.3.7 第七步：健康检查和日志</h4>
<div class="outline-text-4" id="text-3-3-7">
<p>
最后记录启动日志：
</p>

<div class="org-src-container">
<pre class="src src-typescript">logGatewayStartup({
  cfg,
  port: boundPort,
  host: finalHost,
  tlsRuntime,
  hasActiveChannels: channelManager.hasActiveChannels(),
  log,
});
</pre>
</div>

<p>
好家伙，这一个函数真是把所有事情都干了！
</p>
</div>
</div>
</div>
<div id="outline-container-org03b7aca" class="outline-3">
<h3 id="org03b7aca"><span class="section-number-3">3.4.</span> 2.4 启动时都能配什么？GatewayServerOptions</h3>
<div class="outline-text-3" id="text-3-4">
<p>
让我们看看启动时可以传什么参数：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export type GatewayServerOptions = {
  bind?: GatewayBindMode;        // loopback/lan/tailnet/auto
  host?: string;                  // 可以强行指定绑定地址
  controlUiEnabled?: boolean;     // 要不要开控制 UI
  openAiChatCompletionsEnabled?: boolean;
  openResponsesEnabled?: boolean;
  auth?: GatewayAuthConfig;
  tailscale?: GatewayTailscaleConfig;
  // ... 还有一些测试用的选项
};
</pre>
</div>

<p>
注意了！这里有个很重要的点：默认绑定是 =loopback=，也就是 127.0.0.1 —— 这意味着默认只有这台机器自己能访问 Gateway，其他机器连不上。这个后面讲安全的时候还要说。
</p>
</div>
</div>
<div id="outline-container-org8783847" class="outline-3">
<h3 id="org8783847"><span class="section-number-3">3.5.</span> 2.5 这章看完的感觉</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Gateway 启动入口是 <code>startGatewayServer()=，在 =src/gateway/server.impl.ts</code></li>
<li>默认端口是 18789</li>
<li>默认只监听 127.0.0.1（也就是只有这台机器自己能访问）</li>
<li>启动流程大概是：读配置 → 初始化状态 → 启服务器 → 加载插件 → 启动渠道 → 启动各种服务</li>
<li>这个函数真的太长了（44KB），什么都干</li>
</ul>

<p>
好，第二章就到这。下一章我们详细看 HTTP 和 WebSocket 服务器是怎么实现的。
</p>
</div>
</div>
</div>
<div id="outline-container-org520d7ca" class="outline-2">
<h2 id="org520d7ca"><span class="section-number-2">4.</span> 第三章：Gateway 服务器里面都有啥？—— HTTP、WebSocket 和认证</h2>
<div class="outline-text-2" id="text-4">
<p>
上一章我们看到 Gateway 启动了 HTTP 和 WebSocket 服务器，这一章我们详细挖挖它们是怎么实现的。
</p>
</div>
<div id="outline-container-org55db551" class="outline-3">
<h3 id="org55db551"><span class="section-number-3">4.1.</span> 3.1 HTTP 服务器：src/gateway/server-http.ts</h3>
<div class="outline-text-3" id="text-4-1">
<p>
文件路径：=src/gateway/server-http.ts=
</p>

<p>
这个文件定义了 HTTP 服务器的行为。我翻了一下，它处理的路由还挺多的，让我整理一下：
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">路径</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">重定向</td>
<td class="org-left">重定向到 <code>/ui</code> 或其他</td>
</tr>

<tr>
<td class="org-left"><code>/ui/*</code></td>
<td class="org-left">控制 UI</td>
<td class="org-left">Web 管理界面</td>
</tr>

<tr>
<td class="org-left"><code>/ws</code></td>
<td class="org-left">WebSocket</td>
<td class="org-left">WebSocket 升级端点</td>
</tr>

<tr>
<td class="org-left"><code>/v1/chat/completions</code></td>
<td class="org-left">OpenAI API</td>
<td class="org-left">OpenAI 兼容 API</td>
</tr>

<tr>
<td class="org-left"><code>/v1/responses</code></td>
<td class="org-left">OpenResponses API</td>
<td class="org-left">另一个 API</td>
</tr>

<tr>
<td class="org-left"><code>/hooks/*</code></td>
<td class="org-left">Webhooks</td>
<td class="org-left">入站 Webhook</td>
</tr>

<tr>
<td class="org-left"><code>/tools/*</code></td>
<td class="org-left">工具调用</td>
<td class="org-left">工具调用 HTTP API</td>
</tr>

<tr>
<td class="org-left"><code>/canvas/*</code></td>
<td class="org-left">Canvas</td>
<td class="org-left">Canvas 相关</td>
</tr>

<tr>
<td class="org-left"><code>/browser/*</code></td>
<td class="org-left">浏览器</td>
<td class="org-left">浏览器控制</td>
</tr>
</tbody>
</table>

<p>
一个 HTTP 请求进来时，大概是这么个流程：
</p>
<ol class="org-ol">
<li>先做认证检查（=authorizeGatewayConnect()=）</li>
<li>然后路由匹配</li>
<li>最后执行对应的处理器</li>
</ol>
</div>
</div>
<div id="outline-container-orgc300bec" class="outline-3">
<h3 id="orgc300bec"><span class="section-number-3">4.2.</span> 3.2 认证系统：src/gateway/auth.ts</h3>
<div class="outline-text-3" id="text-4-2">
<p>
文件路径：=src/gateway/auth.ts=
</p>

<p>
这个文件很重要！我仔细读了一下，这是 Gateway 的保安 —— 决定谁能进来，谁不能进来。
</p>
</div>
<div id="outline-container-orgc5315da" class="outline-4">
<h4 id="orgc5315da"><span class="section-number-4">4.2.1.</span> 3.2.1 都支持哪几种认证方式？</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
先看类型定义：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export type ResolvedGatewayAuthMode = "none" | "token" | "password" | "trusted-proxy";
</pre>
</div>

<p>
四种模式：
</p>
<ul class="org-ul">
<li><code>none</code> —— 无认证（不推荐！这相当于大门敞开）</li>
<li><code>token</code> —— Token 认证（用一个 secret token）</li>
<li><code>password</code> —— 密码认证</li>
<li><code>trusted-proxy</code> —— 受信任的代理（比如 Tailscale）</li>
</ul>

<p>
还有认证结果的类型：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export type GatewayAuthResult = {
  ok: boolean;
  method?: "none" | "token" | "password" | "tailscale" | "device-token" | "trusted-proxy";
  user?: string;
  reason?: string;
  rateLimited?: boolean;      // 是否被限流了
  retryAfterMs?: number;      // 限流的话要等多久
};
</pre>
</div>
</div>
</div>
