orgs/reading-openclaw.org
*** 3.2.2 认证流程：authorizeGatewayConnect()

这个函数是核心，让我们看看它都做了哪些检查（按代码顺序）：

1. 先检查是不是"本地直接请求"（=isLocalDirectRequest()=）—— 如果是，直接放行
2. 检查有没有 Token 或 Password —— 有就验证
3. 如果是 Tailscale，检查 Tailscale 身份
4. 检查速率限制 —— 试错太多次会被限流

这个设计挺合理的：本地访问最方便，不用认证；远程访问必须认证。

*** 3.2.3 什么算是"本地直接请求"？

这个函数 =isLocalDirectRequest()= 很有意思，让我们看看代码：

#+BEGIN_SRC typescript
export function isLocalDirectRequest(
  req?: IncomingMessage,
  trustedProxies?: string[],
): boolean {
  // 1. 检查客户端 IP 是不是 loopback 地址
  const clientIp = resolveRequestClientIp(req, trustedProxies) ?? "";
  if (!isLoopbackAddress(clientIp)) {
    return false;
  }

  // 2. 检查 Host 头
  const host = getHostName(req.headers?.host);
  const hostIsLocal = host === "localhost" || host === "127.0.0.1" || host === "::1";
  const hostIsTailscaleServe = host.endsWith(".ts.net");

  // 3. 检查有没有 forwarded 头
  const hasForwarded = Boolean(
    req.headers?.["x-forwarded-for"] ||
    req.headers?.["x-real-ip"] ||
    req.headers?.["x-forwarded-host"],
  );

  // 4. 检查 remote 是不是受信任的代理
  const remoteIsTrustedProxy = isTrustedProxyAddress(req.socket?.remoteAddress, trustedProxies);

  // 最终判断
  return (hostIsLocal || hostIsTailscaleServe) && (!hasForwarded || remoteIsTrustedProxy);
}
#+END_SRC

关键点我帮你划出来了：
- 客户端 IP 必须是 loopback 地址（127.0.0.1 或 ::1）
- Host 头必须是 localhost/127.0.0.1/::1，或者是 .ts.net（Tailscale）
- 如果有 forwarded 头，那必须来自受信任的代理

这就解释了为什么默认绑定 127.0.0.1 是安全的 —— 只有这台机器自己能访问。

** 3.3 WebSocket 服务器：src/gateway/server/ws-connection.ts

文件路径：=src/gateway/server/ws-connection.ts=

WebSocket 是 Gateway 的主要通信方式。毕竟 HTTP 是一问一答，而 WebSocket 可以双向实时通信，更适合做控制平面。

我看了一下，WebSocket 消息有定义好的协议格式，在 =src/gateway/protocol/= 目录里。这个后面有机会再细说。

当一个 WebSocket 消息到达时，大概是这么处理的：
1. 解析帧
2. 路由到对应的方法处理器
3. 执行方法
4. 返回结果

** 3.4 Gateway 方法：src/gateway/server-methods/

文件路径：=src/gateway/server-methods/=

这是 Gateway 的"API 端点"目录，每个文件对应一组方法。我数了一下，还挺多的：

| 文件 | 方法组 | 功能 |
|------|--------|------|
| =agent.ts= | =agent.*= | AI 代理调用 |
| =agents.ts= | =agents.*= | 代理管理 |
| =browser.ts= | =browser.*= | 浏览器控制 |
| =channels.ts= | =channels.*= | 渠道管理 |
| =chat.ts= | =chat.*= | 聊天 |
| =config.ts= | =config.*= | 配置管理 |
| =cron.ts= | =cron.*= | 定时任务 |
| =exec-approval.ts= | - | 执行审批 |
| =nodes.ts= | =nodes.*= | 节点管理 |
| =sessions.ts= | =sessions.*= | 会话管理 |
| ... | ... | ... |

这些方法就是 Gateway 提供的所有功能了，后面我们会挑几个重要的看。

** 3.5 网络绑定：src/gateway/net.ts

文件路径：=src/gateway/net.ts=

这个文件决定了 Gateway 怎么绑定到网络接口。

*** 3.5.1 都有哪几种绑定模式？

#+BEGIN_SRC typescript
type GatewayBindMode = "loopback" | "lan" | "tailnet" | "auto";
#+END_SRC

四种模式：
- =loopback= —— 只绑定 127.0.0.1（默认，最安全）
- =lan= —— 绑定 0.0.0.0（局域网可访问，谨慎使用）
- =tailnet= —— 只绑定 Tailscale 地址
- =auto= —— 自动选择（优先 loopback）

划重点：默认是 =loopback=！这意味着默认只有这台机器自己能访问 Gateway，其他机器连不上。这个设计很安全。

这个文件还有一些有用的工具函数：
- =isLoopbackAddress()= —— 检查是不是回环地址
- =isPrivateAddress()= —— 检查是不是私有地址
- =isPrivateOrLoopbackAddress()= —— 两者任一
- =resolveGatewayClientIp()= —— 解析客户端真实 IP（处理代理的情况）

** 3.6 这章看完的感觉

- Gateway 同时提供 HTTP 和 WebSocket 服务
- 默认只监听 127.0.0.1，需要显式配置才能从其他地址访问
- 认证系统支持多种模式：token、password、trusted-proxy、tailscale
- 本地请求（127.0.0.1）不需要认证，这个设计很方便也很安全
- WebSocket 是主要通信方式，有定义良好的协议
- =server-methods/= 目录包含所有 API 方法实现

好，第三章就到这。下一章我们看渠道系统 —— 怎么连 WhatsApp、Telegram 这些。

* 第四章：渠道（Channels）是怎么工作的？—— WhatsApp、Telegram 等逐个看

这一章是我最好奇的部分：OpenClaw 是怎么连这么多消息渠道的？让我们逐个挖。

** 4.1 先看整体结构

在 OpenClaw 中，每个渠道都是相对独立的模块，但它们共享一些公共的抽象。先看看渠道相关的目录：

#+BEGIN_EXAMPLE
src/
├── channels/           # 渠道抽象和公共代码
├── discord/            # Discord 具体实现
├── slack/              # Slack 具体实现
├── telegram/           # Telegram 具体实现
├── signal/             # Signal 具体实现
├── web/                # WhatsApp Web 实现
├── imessage/           # iMessage 实现
├── line/               # Line 实现
└── ...（更多渠道）
#+END_EXAMPLE

每个渠道一个目录，这个设计很清晰。

** 4.2 WhatsApp 渠道：src/web/

文件路径：=src/web/=

WhatsApp 是通过 WhatsApp Web 实现的，用的是 =@whiskeysockets/baileys= 这个库。

先看看 =src/web/= 的目录结构：

#+BEGIN_EXAMPLE
src/web/
├── inbound/              # 入站消息处理
│   ├── access-control.ts # 访问控制！这个很重要
│   ├── monitor.ts        # 监控
│   └── send-api.ts       # 发送 API
├── outbound.ts           # 出站消息
├── monitor.ts            # 主监控器
├── session.ts            # 会话管理
├── login.ts              # 登录
└── ...
#+END_EXAMPLE

