docs/reading-openclaw.html
<div id="outline-container-org064646e" class="outline-4">
<h4 id="org064646e"><span class="section-number-4">4.2.2.</span> 3.2.2 认证流程：authorizeGatewayConnect()</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
这个函数是核心，让我们看看它都做了哪些检查（按代码顺序）：
</p>

<ol class="org-ol">
<li>先检查是不是"本地直接请求"（=isLocalDirectRequest()=）—— 如果是，直接放行</li>
<li>检查有没有 Token 或 Password —— 有就验证</li>
<li>如果是 Tailscale，检查 Tailscale 身份</li>
<li>检查速率限制 —— 试错太多次会被限流</li>
</ol>

<p>
这个设计挺合理的：本地访问最方便，不用认证；远程访问必须认证。
</p>
</div>
</div>
<div id="outline-container-org449c22a" class="outline-4">
<h4 id="org449c22a"><span class="section-number-4">4.2.3.</span> 3.2.3 什么算是"本地直接请求"？</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
这个函数 <code>isLocalDirectRequest()</code> 很有意思，让我们看看代码：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export function isLocalDirectRequest(
  req?: IncomingMessage,
  trustedProxies?: string[],
): boolean {
  // 1. 检查客户端 IP 是不是 loopback 地址
  const clientIp = resolveRequestClientIp(req, trustedProxies) ?? "";
  if (!isLoopbackAddress(clientIp)) {
    return false;
  }

  // 2. 检查 Host 头
  const host = getHostName(req.headers?.host);
  const hostIsLocal = host === "localhost" || host === "127.0.0.1" || host === "::1";
  const hostIsTailscaleServe = host.endsWith(".ts.net");

  // 3. 检查有没有 forwarded 头
  const hasForwarded = Boolean(
    req.headers?.["x-forwarded-for"] ||
    req.headers?.["x-real-ip"] ||
    req.headers?.["x-forwarded-host"],
  );

  // 4. 检查 remote 是不是受信任的代理
  const remoteIsTrustedProxy = isTrustedProxyAddress(req.socket?.remoteAddress, trustedProxies);

  // 最终判断
  return (hostIsLocal || hostIsTailscaleServe) &amp;&amp; (!hasForwarded || remoteIsTrustedProxy);
}
</pre>
</div>

<p>
关键点我帮你划出来了：
</p>
<ul class="org-ul">
<li>客户端 IP 必须是 loopback 地址（127.0.0.1 或 ::1）</li>
<li>Host 头必须是 localhost/127.0.0.1/::1，或者是 .ts.net（Tailscale）</li>
<li>如果有 forwarded 头，那必须来自受信任的代理</li>
</ul>

<p>
这就解释了为什么默认绑定 127.0.0.1 是安全的 —— 只有这台机器自己能访问。
</p>
</div>
</div>
</div>
<div id="outline-container-org0a9f71e" class="outline-3">
<h3 id="org0a9f71e"><span class="section-number-3">4.3.</span> 3.3 WebSocket 服务器：src/gateway/server/ws-connection.ts</h3>
<div class="outline-text-3" id="text-4-3">
<p>
文件路径：=src/gateway/server/ws-connection.ts=
</p>

<p>
WebSocket 是 Gateway 的主要通信方式。毕竟 HTTP 是一问一答，而 WebSocket 可以双向实时通信，更适合做控制平面。
</p>

<p>
我看了一下，WebSocket 消息有定义好的协议格式，在 <code>src/gateway/protocol/</code> 目录里。这个后面有机会再细说。
</p>

<p>
当一个 WebSocket 消息到达时，大概是这么处理的：
</p>
<ol class="org-ol">
<li>解析帧</li>
<li>路由到对应的方法处理器</li>
<li>执行方法</li>
<li>返回结果</li>
</ol>
</div>
</div>
<div id="outline-container-orgd0c529a" class="outline-3">
<h3 id="orgd0c529a"><span class="section-number-3">4.4.</span> 3.4 Gateway 方法：src/gateway/server-methods/</h3>
<div class="outline-text-3" id="text-4-4">
<p>
文件路径：=src/gateway/server-methods/=
</p>

<p>
这是 Gateway 的"API 端点"目录，每个文件对应一组方法。我数了一下，还挺多的：
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">文件</th>
<th scope="col" class="org-left">方法组</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>agent.ts</code></td>
<td class="org-left"><code>agent.*</code></td>
<td class="org-left">AI 代理调用</td>
</tr>

<tr>
<td class="org-left"><code>agents.ts</code></td>
<td class="org-left"><code>agents.*</code></td>
<td class="org-left">代理管理</td>
</tr>

<tr>
<td class="org-left"><code>browser.ts</code></td>
<td class="org-left"><code>browser.*</code></td>
<td class="org-left">浏览器控制</td>
</tr>

<tr>
<td class="org-left"><code>channels.ts</code></td>
<td class="org-left"><code>channels.*</code></td>
<td class="org-left">渠道管理</td>
</tr>

<tr>
<td class="org-left"><code>chat.ts</code></td>
<td class="org-left"><code>chat.*</code></td>
<td class="org-left">聊天</td>
</tr>

<tr>
<td class="org-left"><code>config.ts</code></td>
<td class="org-left"><code>config.*</code></td>
<td class="org-left">配置管理</td>
</tr>

<tr>
<td class="org-left"><code>cron.ts</code></td>
<td class="org-left"><code>cron.*</code></td>
<td class="org-left">定时任务</td>
</tr>

<tr>
<td class="org-left"><code>exec-approval.ts</code></td>
<td class="org-left">-</td>
<td class="org-left">执行审批</td>
</tr>

<tr>
<td class="org-left"><code>nodes.ts</code></td>
<td class="org-left"><code>nodes.*</code></td>
<td class="org-left">节点管理</td>
</tr>

<tr>
<td class="org-left"><code>sessions.ts</code></td>
<td class="org-left"><code>sessions.*</code></td>
<td class="org-left">会话管理</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>

<p>
这些方法就是 Gateway 提供的所有功能了，后面我们会挑几个重要的看。
</p>
</div>
</div>
<div id="outline-container-org8c0673a" class="outline-3">
<h3 id="org8c0673a"><span class="section-number-3">4.5.</span> 3.5 网络绑定：src/gateway/net.ts</h3>
<div class="outline-text-3" id="text-4-5">
<p>
文件路径：=src/gateway/net.ts=
</p>

<p>
这个文件决定了 Gateway 怎么绑定到网络接口。
</p>
</div>
<div id="outline-container-orgee522b0" class="outline-4">
<h4 id="orgee522b0"><span class="section-number-4">4.5.1.</span> 3.5.1 都有哪几种绑定模式？</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="org-src-container">
<pre class="src src-typescript">type GatewayBindMode = "loopback" | "lan" | "tailnet" | "auto";
</pre>
</div>

<p>
四种模式：
</p>
<ul class="org-ul">
<li><code>loopback</code> —— 只绑定 127.0.0.1（默认，最安全）</li>
<li><code>lan</code> —— 绑定 0.0.0.0（局域网可访问，谨慎使用）</li>
<li><code>tailnet</code> —— 只绑定 Tailscale 地址</li>
<li><code>auto</code> —— 自动选择（优先 loopback）</li>
</ul>

<p>
划重点：默认是 =loopback=！这意味着默认只有这台机器自己能访问 Gateway，其他机器连不上。这个设计很安全。
</p>

<p>
这个文件还有一些有用的工具函数：
</p>
<ul class="org-ul">
<li><code>isLoopbackAddress()</code> —— 检查是不是回环地址</li>
<li><code>isPrivateAddress()</code> —— 检查是不是私有地址</li>
<li><code>isPrivateOrLoopbackAddress()</code> —— 两者任一</li>
<li><code>resolveGatewayClientIp()</code> —— 解析客户端真实 IP（处理代理的情况）</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org18fd718" class="outline-3">
<h3 id="org18fd718"><span class="section-number-3">4.6.</span> 3.6 这章看完的感觉</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>Gateway 同时提供 HTTP 和 WebSocket 服务</li>
<li>默认只监听 127.0.0.1，需要显式配置才能从其他地址访问</li>
<li>认证系统支持多种模式：token、password、trusted-proxy、tailscale</li>
<li>本地请求（127.0.0.1）不需要认证，这个设计很方便也很安全</li>
<li>WebSocket 是主要通信方式，有定义良好的协议</li>
<li><code>server-methods/</code> 目录包含所有 API 方法实现</li>
</ul>

<p>
好，第三章就到这。下一章我们看渠道系统 —— 怎么连 WhatsApp、Telegram 这些。
</p>
</div>
</div>
</div>
<div id="outline-container-org8724d56" class="outline-2">
<h2 id="org8724d56"><span class="section-number-2">5.</span> 第四章：渠道（Channels）是怎么工作的？—— WhatsApp、Telegram 等逐个看</h2>
<div class="outline-text-2" id="text-5">
<p>
这一章是我最好奇的部分：OpenClaw 是怎么连这么多消息渠道的？让我们逐个挖。
</p>
</div>
<div id="outline-container-org73258df" class="outline-3">
<h3 id="org73258df"><span class="section-number-3">5.1.</span> 4.1 先看整体结构</h3>
<div class="outline-text-3" id="text-5-1">
<p>
在 OpenClaw 中，每个渠道都是相对独立的模块，但它们共享一些公共的抽象。先看看渠道相关的目录：
</p>

<pre class="example" id="orgd4ee8fe">
src/
├── channels/           # 渠道抽象和公共代码
├── discord/            # Discord 具体实现
├── slack/              # Slack 具体实现
├── telegram/           # Telegram 具体实现
├── signal/             # Signal 具体实现
├── web/                # WhatsApp Web 实现
├── imessage/           # iMessage 实现
├── line/               # Line 实现
└── ...（更多渠道）
</pre>

<p>
每个渠道一个目录，这个设计很清晰。
</p>
</div>
</div>
<div id="outline-container-org6569d0c" class="outline-3">
<h3 id="org6569d0c"><span class="section-number-3">5.2.</span> 4.2 WhatsApp 渠道：src/web/</h3>
<div class="outline-text-3" id="text-5-2">
<p>
文件路径：=src/web/=
</p>

<p>
WhatsApp 是通过 WhatsApp Web 实现的，用的是 <code>@whiskeysockets/baileys</code> 这个库。
</p>

<p>
先看看 <code>src/web/</code> 的目录结构：
</p>

<pre class="example" id="orgc9a7d67">
src/web/
├── inbound/              # 入站消息处理
│   ├── access-control.ts # 访问控制！这个很重要
│   ├── monitor.ts        # 监控
│   └── send-api.ts       # 发送 API
├── outbound.ts           # 出站消息
├── monitor.ts            # 主监控器
├── session.ts            # 会话管理
├── login.ts              # 登录
└── ...
</pre>
</div>
