orgs/reading-openclaw.org
*** 4.2.1 访问控制：src/web/inbound/access-control.ts

文件路径：=src/web/inbound/access-control.ts=

这个文件很有意思！我仔细读了一下，它决定谁的消息会被处理，谁的会被忽略。让我们看看核心逻辑：

#+BEGIN_SRC typescript
export async function checkInboundAccessControl(params: {
  accountId: string;
  from: string;
  selfE164: string | null;
  senderE164: string | null;
  group: boolean;
  pushName?: string;
  isFromMe: boolean;
  // ... 更多参数
}): Promise<InboundAccessControlResult> {
  const cfg = loadConfig();
  const account = resolveWhatsAppAccount({ cfg, accountId: params.accountId });

  // dmPolicy 默认是 "pairing"
  const dmPolicy = account.dmPolicy ?? "pairing";

  // 从配置和存储中读取 allowFrom 白名单
  const configuredAllowFrom = account.allowFrom;
  const storeAllowFrom = await readChannelAllowFromStore("whatsapp").catch(() => []);
  const combinedAllowFrom = Array.from(
    new Set([...(configuredAllowFrom ?? []), ...storeAllowFrom]),
  );

  // 如果没有配置白名单，默认只允许自己给自己发消息
  const defaultAllowFrom =
    combinedAllowFrom.length === 0 && params.selfE164
      ? [params.selfE164]
      : undefined;

  const allowFrom = combinedAllowFrom.length > 0
    ? combinedAllowFrom
    : defaultAllowFrom;

  // ... 中间一堆检查逻辑 ...

  // DM 访问控制（默认是 "pairing" 模式）
  if (!params.group) {
    // 如果不是 "open" 模式，而且不是自己
    if (dmPolicy !== "open" && !isSamePhone) {
      const candidate = params.from;
      const allowed =
        dmHasWildcard ||
        (normalizedAllowFrom.length > 0 && normalizedAllowFrom.includes(candidate));

      // 如果不在白名单里
      if (!allowed) {
        // 如果是 pairing 模式，给对方发一个配对码
        if (dmPolicy === "pairing") {
          const { code, created } = await upsertChannelPairingRequest({
            channel: "whatsapp",
            id: candidate,
            meta: { name: (params.pushName ?? "").trim() || undefined },
          });
          if (created) {
            // 给对方发配对码
            await params.sock.sendMessage(params.remoteJid, {
              text: buildPairingReply({
                channel: "whatsapp",
                idLine: `Your WhatsApp phone number: ${candidate}`,
                code,
              }),
            });
          }
        }
        // 拒绝这条消息
        return { allowed: false, ... };
      }
    }
  }

  // 所有检查都通过了，允许这条消息
  return { allowed: true, ... };
}
#+END_SRC

这段代码太重要了，我帮你总结一下关键点：

1. 默认 dmPolicy 是 "pairing" —— 陌生人发消息会收到一个配对码，不会直接处理
2. allowFrom 白名单 —— 只有在白名单里的人才能发消息
3. 默认只允许自己 —— 如果没配置白名单，默认只允许自己给自己发消息
4. 群组也有策略 —— "open"、"disabled"、"allowlist" 三种

这个安全设计很到位！

** 4.3 Telegram 渠道：src/telegram/

文件路径：=src/telegram/=

Telegram 用的是 =grammy= 库。我翻了一下，它支持两种接收消息的方式：

1. Polling（轮询）—— 定期去 Telegram 服务器问"有新消息吗？"
2. Webhook —— Telegram 有新消息时主动推送给你

这两种方式在代码里都有实现，分别在 =monitor.ts= 和 =webhook.ts= 里。

** 4.4 其他渠道

我简单翻了一下其他渠道：

- Slack（=src/slack/=）：用 =@slack/bolt=，主要通过 Webhook 接收事件
- Discord（=src/discord/=）：有自己的 Gateway（WebSocket）协议
- Signal（=src/signal/=）：用 =signal-cli=，通过 SSE（Server-Sent Events）接收消息
- iMessage（=src/imessage/=）：这个比较特殊，是通过监控本地数据库实现的！

每个渠道的实现方式都不太一样，但都有一个共同点：都有访问控制机制。

** 4.5 几个通用概念

不管是哪个渠道，都有一些共同的概念：

- 入站（Inbound）—— 从渠道收到消息
- 出站（Outbound）—— 往渠道发送消息
- 监控（Monitor）—— 每个渠道都有一个 "monitor" 组件负责接收消息
- 发送（Send）—— 每个渠道都有 "send" 组件负责发送消息

** 4.6 这章看完的感觉

- 每个渠道都有独立的实现，但共享公共抽象
- 不同渠道使用不同的通信方式：轮询、Webhook、WebSocket、SSE、本地文件监控等
- 每个渠道都有访问控制机制（=allowFrom=、=dmPolicy= 等）
- WhatsApp 是通过 WhatsApp Web 实现的，iMessage 是通过本地数据库实现的
- 默认安全策略很严格：陌生人需要配对，不在白名单的消息会被忽略

好，第四章就到这。这一章我们不看会话管理了，先看一个更重要的：安全审计工具。

* 第五章：安全审计工具 —— =openclaw security audit= 是怎么实现的？

我翻代码的时候发现了一个好东西：=src/security/= 目录。OpenClaw 居然自带了安全审计工具！这章我们专门看这个。

** 5.1 先看审计结果类型

文件路径：=src/security/audit.ts=

先看类型定义，能知道审计都检查什么：

#+BEGIN_SRC typescript
export type SecurityAuditSeverity = "info" | "warn" | "critical";

export type SecurityAuditFinding = {
  checkId: string;
  severity: SecurityAuditSeverity;  // 严重级别
  title: string;
  detail: string;
  remediation?: string;             // 修复建议
};

export type SecurityAuditReport = {
  ts: number;
  summary: {
    critical: number;
    warn: number;
    info: number;
  };
  findings: SecurityAuditFinding[];
  deep?: {
    gateway?: {
      attempted: boolean;
      url: string | null;
      ok: boolean;
      error: string | null;
    };
  };
};
#+END_SRC

三个严重级别：
- =info= —— 信息，没关系
- =warn= —— 警告，最好改改
- =critical= —— 严重，必须改！

** 5.2 都检查哪些东西？

我数了一下，检查项还挺多的。让我从代码里整理一下：

*** 5.2.1 文件系统权限检查

在 =collectFilesystemFindings()= 函数里，检查这些：

| 检查项 | 严重级别 | 说明 |
|--------|----------|------|
| State dir is world-writable | critical | 状态目录所有人可写 |
| State dir is group-writable | warn | 状态目录组用户可写 |
| State dir is readable by others | warn | 状态目录其他人可读 |
| Config file is writable by others | critical | 配置文件其他人可写 |
| Config file is world-readable | critical | 配置文件所有人可读（可能包含 token！） |
| Config file is group-readable | warn | 配置文件组用户可读 |

划重点：配置文件权限是 critical 级别的！因为配置文件里可能存着 API Key、Token 这些敏感信息。

看这段代码：

#+BEGIN_SRC typescript
if (configPerms.worldWritable || configPerms.groupWritable) {
  findings.push({
    checkId: "fs.config.perms_writable",
    severity: "critical",
    title: "Config file is writable by others",
    detail: `${formatPermissionDetail(params.configPath, configPerms)}; another user could change gateway/auth/tool policies.`,
    remediation: formatPermissionRemediation({
      targetPath: params.configPath,
      perms: configPerms,
      isDir: false,
      posixMode: 0o600,  // ← 推荐权限：只有自己能读写
      env: params.env,
    }),
  });
}
#+END_SRC

推荐权限是 =0o600= —— 只有文件所有者能读写，这个很安全。

*** 5.2.2 Gateway 配置检查

在 =collectGatewayConfigFindings()= 函数里，检查这些：

- Gateway bind mode —— 如果不是 loopback，会 warn
- Gateway auth mode —— 如果是 none，会 critical！
- Tailscale mode —— 如果是 funnel 但没有 password auth，会 critical
- 等等...

又一个重点：如果 Gateway 认证模式是 none，是 critical 级别的！这相当于大门敞开。

*** 5.2.3 还有更多检查项

我看了一下 =audit-extra.ts=，还有这些检查：

- =collectAttackSurfaceSummaryFindings()= —— 攻击面总结
- =collectExposureMatrixFindings()= —— 暴露矩阵
- =collectSecretsInConfigFindings()= —— 配置文件里有没有秘密
- =collectModelHygieneFindings()= —— 模型卫生
- =collectPluginsTrustFindings()= —— 插件信任
- =collectInstalledSkillsCodeSafetyFindings()= —— 已安装技能的代码安全
- =collectChannelSecurityFindings()= —— 渠道安全
- 等等...

检查项真的很全！

