docs/reading-openclaw.html
<div id="outline-container-org4fae5eb" class="outline-4">
<h4 id="org4fae5eb"><span class="section-number-4">5.2.1.</span> 4.2.1 访问控制：src/web/inbound/access-control.ts</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
文件路径：=src/web/inbound/access-control.ts=
</p>

<p>
这个文件很有意思！我仔细读了一下，它决定谁的消息会被处理，谁的会被忽略。让我们看看核心逻辑：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export async function checkInboundAccessControl(params: {
  accountId: string;
  from: string;
  selfE164: string | null;
  senderE164: string | null;
  group: boolean;
  pushName?: string;
  isFromMe: boolean;
  // ... 更多参数
}): Promise&lt;InboundAccessControlResult&gt; {
  const cfg = loadConfig();
  const account = resolveWhatsAppAccount({ cfg, accountId: params.accountId });

  // dmPolicy 默认是 "pairing"
  const dmPolicy = account.dmPolicy ?? "pairing";

  // 从配置和存储中读取 allowFrom 白名单
  const configuredAllowFrom = account.allowFrom;
  const storeAllowFrom = await readChannelAllowFromStore("whatsapp").catch(() =&gt; []);
  const combinedAllowFrom = Array.from(
    new Set([...(configuredAllowFrom ?? []), ...storeAllowFrom]),
  );

  // 如果没有配置白名单，默认只允许自己给自己发消息
  const defaultAllowFrom =
    combinedAllowFrom.length === 0 &amp;&amp; params.selfE164
      ? [params.selfE164]
      : undefined;

  const allowFrom = combinedAllowFrom.length &gt; 0
    ? combinedAllowFrom
    : defaultAllowFrom;

  // ... 中间一堆检查逻辑 ...

  // DM 访问控制（默认是 "pairing" 模式）
  if (!params.group) {
    // 如果不是 "open" 模式，而且不是自己
    if (dmPolicy !== "open" &amp;&amp; !isSamePhone) {
      const candidate = params.from;
      const allowed =
        dmHasWildcard ||
        (normalizedAllowFrom.length &gt; 0 &amp;&amp; normalizedAllowFrom.includes(candidate));

      // 如果不在白名单里
      if (!allowed) {
        // 如果是 pairing 模式，给对方发一个配对码
        if (dmPolicy === "pairing") {
          const { code, created } = await upsertChannelPairingRequest({
            channel: "whatsapp",
            id: candidate,
            meta: { name: (params.pushName ?? "").trim() || undefined },
          });
          if (created) {
            // 给对方发配对码
            await params.sock.sendMessage(params.remoteJid, {
              text: buildPairingReply({
                channel: "whatsapp",
                idLine: `Your WhatsApp phone number: ${candidate}`,
                code,
              }),
            });
          }
        }
        // 拒绝这条消息
        return { allowed: false, ... };
      }
    }
  }

  // 所有检查都通过了，允许这条消息
  return { allowed: true, ... };
}
</pre>
</div>

<p>
这段代码太重要了，我帮你总结一下关键点：
</p>

<ol class="org-ol">
<li>默认 dmPolicy 是 "pairing" —— 陌生人发消息会收到一个配对码，不会直接处理</li>
<li>allowFrom 白名单 —— 只有在白名单里的人才能发消息</li>
<li>默认只允许自己 —— 如果没配置白名单，默认只允许自己给自己发消息</li>
<li>群组也有策略 —— "open"、"disabled"、"allowlist" 三种</li>
</ol>

<p>
这个安全设计很到位！
</p>
</div>
</div>
</div>
<div id="outline-container-org02f3aaf" class="outline-3">
<h3 id="org02f3aaf"><span class="section-number-3">5.3.</span> 4.3 Telegram 渠道：src/telegram/</h3>
<div class="outline-text-3" id="text-5-3">
<p>
文件路径：=src/telegram/=
</p>

<p>
Telegram 用的是 <code>grammy</code> 库。我翻了一下，它支持两种接收消息的方式：
</p>

<ol class="org-ol">
<li>Polling（轮询）—— 定期去 Telegram 服务器问"有新消息吗？"</li>
<li>Webhook —— Telegram 有新消息时主动推送给你</li>
</ol>

<p>
这两种方式在代码里都有实现，分别在 <code>monitor.ts</code> 和 <code>webhook.ts</code> 里。
</p>
</div>
</div>
<div id="outline-container-orgfa3b8f7" class="outline-3">
<h3 id="orgfa3b8f7"><span class="section-number-3">5.4.</span> 4.4 其他渠道</h3>
<div class="outline-text-3" id="text-5-4">
<p>
我简单翻了一下其他渠道：
</p>

<ul class="org-ul">
<li>Slack（=src/slack/=）：用 =@slack/bolt=，主要通过 Webhook 接收事件</li>
<li>Discord（=src/discord/=）：有自己的 Gateway（WebSocket）协议</li>
<li>Signal（=src/signal/=）：用 =signal-cli=，通过 SSE（Server-Sent Events）接收消息</li>
<li>iMessage（=src/imessage/=）：这个比较特殊，是通过监控本地数据库实现的！</li>
</ul>

<p>
每个渠道的实现方式都不太一样，但都有一个共同点：都有访问控制机制。
</p>
</div>
</div>
<div id="outline-container-orge4e6a47" class="outline-3">
<h3 id="orge4e6a47"><span class="section-number-3">5.5.</span> 4.5 几个通用概念</h3>
<div class="outline-text-3" id="text-5-5">
<p>
不管是哪个渠道，都有一些共同的概念：
</p>

<ul class="org-ul">
<li>入站（Inbound）—— 从渠道收到消息</li>
<li>出站（Outbound）—— 往渠道发送消息</li>
<li>监控（Monitor）—— 每个渠道都有一个 "monitor" 组件负责接收消息</li>
<li>发送（Send）—— 每个渠道都有 "send" 组件负责发送消息</li>
</ul>
</div>
</div>
<div id="outline-container-orgfeb3394" class="outline-3">
<h3 id="orgfeb3394"><span class="section-number-3">5.6.</span> 4.6 这章看完的感觉</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>每个渠道都有独立的实现，但共享公共抽象</li>
<li>不同渠道使用不同的通信方式：轮询、Webhook、WebSocket、SSE、本地文件监控等</li>
<li>每个渠道都有访问控制机制（=allowFrom=、=dmPolicy= 等）</li>
<li>WhatsApp 是通过 WhatsApp Web 实现的，iMessage 是通过本地数据库实现的</li>
<li>默认安全策略很严格：陌生人需要配对，不在白名单的消息会被忽略</li>
</ul>

<p>
好，第四章就到这。这一章我们不看会话管理了，先看一个更重要的：安全审计工具。
</p>
</div>
</div>
</div>
<div id="outline-container-orgdaa332a" class="outline-2">
<h2 id="orgdaa332a"><span class="section-number-2">6.</span> 第五章：安全审计工具 —— <code>openclaw security audit</code> 是怎么实现的？</h2>
<div class="outline-text-2" id="text-6">
<p>
我翻代码的时候发现了一个好东西：=src/security/= 目录。OpenClaw 居然自带了安全审计工具！这章我们专门看这个。
</p>
</div>
<div id="outline-container-orge9ed99d" class="outline-3">
<h3 id="orge9ed99d"><span class="section-number-3">6.1.</span> 5.1 先看审计结果类型</h3>
<div class="outline-text-3" id="text-6-1">
<p>
文件路径：=src/security/audit.ts=
</p>

<p>
先看类型定义，能知道审计都检查什么：
</p>

<div class="org-src-container">
<pre class="src src-typescript">export type SecurityAuditSeverity = "info" | "warn" | "critical";

export type SecurityAuditFinding = {
  checkId: string;
  severity: SecurityAuditSeverity;  // 严重级别
  title: string;
  detail: string;
  remediation?: string;             // 修复建议
};

export type SecurityAuditReport = {
  ts: number;
  summary: {
    critical: number;
    warn: number;
    info: number;
  };
  findings: SecurityAuditFinding[];
  deep?: {
    gateway?: {
      attempted: boolean;
      url: string | null;
      ok: boolean;
      error: string | null;
    };
  };
};
</pre>
</div>

<p>
三个严重级别：
</p>
<ul class="org-ul">
<li><code>info</code> —— 信息，没关系</li>
<li><code>warn</code> —— 警告，最好改改</li>
<li><code>critical</code> —— 严重，必须改！</li>
</ul>
</div>
</div>
<div id="outline-container-orgc0e7422" class="outline-3">
<h3 id="orgc0e7422"><span class="section-number-3">6.2.</span> 5.2 都检查哪些东西？</h3>
<div class="outline-text-3" id="text-6-2">
<p>
我数了一下，检查项还挺多的。让我从代码里整理一下：
</p>
</div>
<div id="outline-container-orge891852" class="outline-4">
<h4 id="orge891852"><span class="section-number-4">6.2.1.</span> 5.2.1 文件系统权限检查</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
在 <code>collectFilesystemFindings()</code> 函数里，检查这些：
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">检查项</th>
<th scope="col" class="org-left">严重级别</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">State dir is world-writable</td>
<td class="org-left">critical</td>
<td class="org-left">状态目录所有人可写</td>
</tr>

<tr>
<td class="org-left">State dir is group-writable</td>
<td class="org-left">warn</td>
<td class="org-left">状态目录组用户可写</td>
</tr>

<tr>
<td class="org-left">State dir is readable by others</td>
<td class="org-left">warn</td>
<td class="org-left">状态目录其他人可读</td>
</tr>

<tr>
<td class="org-left">Config file is writable by others</td>
<td class="org-left">critical</td>
<td class="org-left">配置文件其他人可写</td>
</tr>

<tr>
<td class="org-left">Config file is world-readable</td>
<td class="org-left">critical</td>
<td class="org-left">配置文件所有人可读（可能包含 token！）</td>
</tr>

<tr>
<td class="org-left">Config file is group-readable</td>
<td class="org-left">warn</td>
<td class="org-left">配置文件组用户可读</td>
</tr>
</tbody>
</table>

<p>
划重点：配置文件权限是 critical 级别的！因为配置文件里可能存着 API Key、Token 这些敏感信息。
</p>

<p>
看这段代码：
</p>

<div class="org-src-container">
<pre class="src src-typescript">if (configPerms.worldWritable || configPerms.groupWritable) {
  findings.push({
    checkId: "fs.config.perms_writable",
    severity: "critical",
    title: "Config file is writable by others",
    detail: `${formatPermissionDetail(params.configPath, configPerms)}; another user could change gateway/auth/tool policies.`,
    remediation: formatPermissionRemediation({
      targetPath: params.configPath,
      perms: configPerms,
      isDir: false,
      posixMode: 0o600,  // ← 推荐权限：只有自己能读写
      env: params.env,
    }),
  });
}
</pre>
</div>

<p>
推荐权限是 <code>0o600</code> —— 只有文件所有者能读写，这个很安全。
</p>
</div>
</div>
<div id="outline-container-org477f7ed" class="outline-4">
<h4 id="org477f7ed"><span class="section-number-4">6.2.2.</span> 5.2.2 Gateway 配置检查</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
在 <code>collectGatewayConfigFindings()</code> 函数里，检查这些：
</p>

<ul class="org-ul">
<li>Gateway bind mode —— 如果不是 loopback，会 warn</li>
<li>Gateway auth mode —— 如果是 none，会 critical！</li>
<li>Tailscale mode —— 如果是 funnel 但没有 password auth，会 critical</li>
<li>等等&#x2026;</li>
</ul>

<p>
又一个重点：如果 Gateway 认证模式是 none，是 critical 级别的！这相当于大门敞开。
</p>
</div>
</div>
<div id="outline-container-orgb9fe1cc" class="outline-4">
<h4 id="orgb9fe1cc"><span class="section-number-4">6.2.3.</span> 5.2.3 还有更多检查项</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
我看了一下 =audit-extra.ts=，还有这些检查：
</p>

<ul class="org-ul">
<li><code>collectAttackSurfaceSummaryFindings()</code> —— 攻击面总结</li>
<li><code>collectExposureMatrixFindings()</code> —— 暴露矩阵</li>
<li><code>collectSecretsInConfigFindings()</code> —— 配置文件里有没有秘密</li>
<li><code>collectModelHygieneFindings()</code> —— 模型卫生</li>
<li><code>collectPluginsTrustFindings()</code> —— 插件信任</li>
<li><code>collectInstalledSkillsCodeSafetyFindings()</code> —— 已安装技能的代码安全</li>
<li><code>collectChannelSecurityFindings()</code> —— 渠道安全</li>
<li>等等&#x2026;</li>
</ul>

<p>
检查项真的很全！
</p>
</div>
</div>
</div>
